'''
TODO (№ 6792) (ЕГЭ-2023) Система наблюдения ежеминутно фиксирует вход и выход посетителей магазина (в минутах, прошедших от начала суток).
    Считается, что в минуты фиксации входа и выхода посетитель находится в магазине.
    Нулевая минута соответствует моменту открытия магазина, который работает 24 ч в сутки без перерыва.
    Менеджер магазина анализирует данные системы наблюдения за прошедшие сутки, и выявляет отрезки времени наибольшей длины, в течение которых число посетителей, находящихся в магазине, не изменялось.
    Далее менеджер выбирает пики посещаемости – промежутки времени, когда количество посетителей в магазине было наибольшим.
    Пиков посещаемости в течение суток может быть несколько.
    Входной файл содержит время входа и выхода каждого посетителя магазина. Определите, сколько пиков посещаемости было в течение суток, и укажите число посетителей в момент пика посещаемости.

TODO Входные данные представлены в файле 26-130.txt следующим образом. Первая строка входного файла содержит натуральное число N (1 ≤ N ≤ 10000) – количество посетителей магазина. Следующие N строк содержат пары чисел, обозначающих соответственно время входа и время выхода посетителя (все числа натуральные, не превышающие 1440).
    Запишите в ответе два натуральных числа: сначала найденное количество пиков посещаемости, а затем число посетителей в момент пика посещаемости.
'''
MAX = 0
k = 0
l = []
db = {}
with open('26.txt', mode='r') as file:
    size = int(file.readline())
    for el in file:
        starttime, endtime = map(int, el.split())
        l.append([starttime, endtime])

l = sorted(l, key=lambda y:y[0])
for day in range(0, 24*60+1):
    count = 0
    for req in l:
        StartTime = 0
        EndTime = 1
        if day >= req[StartTime] and day <= req[EndTime]:
            count += 1

    if count > MAX:
        try:
            db[count] += 1
        except:
            db[count] = 1
        MAX = count

print(db[MAX], MAX)